## Introduction to Pandas

#### This is an sample data learning the queries in Pandas

In [3]:
import pandas as pd

df = pd.read_csv('employees.csv')

print(df.head(10))

  First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0    Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1     Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2      Maria  Female   4/23/1993        11:17 AM  130590   11.858
3      Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4      Larry    Male   1/24/1998         4:47 PM  101004    1.389
5     Dennis    Male   4/18/1987         1:35 AM  115163   10.125
6       Ruby  Female   8/17/1987         4:20 PM   65476   10.012
7        NaN  Female   7/20/2015        10:43 AM   45906   11.598
8     Angela  Female  11/22/2005         6:29 AM   95570   18.523
9    Frances  Female    8/8/2002         6:51 AM  139852    7.524

  Senior_Management                  Team
0              True             Marketing
1              True                   NaN
2             False               Finance
3              True               Finance
4              True       Client Services
5             False                 Legal
6              True               Product
7               NaN               Finance
8              True           Engineering
9              True  Business Development

#### How to select the column from the DataFrame

##### print first name and Gender

*syntax : pd.DataFrame(df, columns=['column1','column2'])*

In [9]:
x = pd.DataFrame(df, columns=['First_Name', 'Gender'])
print(x)

    First_Name  Gender
0      Douglas    Male
1       Thomas    Male
2        Maria  Female
3        Jerry    Male
4        Larry    Male
..         ...     ...
995      Henry     NaN
996    Phillip    Male
997    Russell    Male
998      Larry    Male
999     Albert    Male

[1000 rows x 2 columns]

#### Get the Size of a DataFrame
##### print the no of rows and column in this array [number of rows, number of columns]

In [11]:
num_rows , num_columns = df.shape

print(num_rows, num_columns)

1000 8

### Display the first three rows

In [12]:
print(df.head(3))

  First_Name  Gender Start_Date Last_Login Time  Salary  Bonus %  \
0    Douglas    Male   8/6/1993        12:42 PM   97308    6.945
1     Thomas    Male  3/31/1996         6:53 AM   61933    4.170
2      Maria  Female  4/23/1993        11:17 AM  130590   11.858

  Senior_Management       Team
0              True  Marketing
1              True        NaN
2             False    Finance

### Select the Data
#### print the First_name and Salary where Gender = Male

In [24]:
x = df[df['Gender'] == 'Male'][['First_Name', 'Salary']]

print(x)

    First_Name  Salary
0      Douglas   97308
1       Thomas   61933
3        Jerry  138705
4        Larry  101004
5       Dennis  115163
..         ...     ...
994     George   98874
996    Phillip   42392
997    Russell   96914
998      Larry   60500
999     Albert  129949

[424 rows x 2 columns]

#### Create a New Column
##### Create a New Column of salary * 2 with Bonus

In [25]:
df['Bonus'] = df['Salary']*2

print(df)

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[1000 rows x 9 columns]

#### Drop Duplicate Rows

##### Drop duplicate rows on First_Name and keep the first record

In [31]:
print(df.drop_duplicates(['First_Name'], keep='first'))

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
712     Martin     NaN    2/6/2001         4:17 AM  123963   15.745
749      Janet     NaN   1/25/1986         5:48 AM   85789    9.712
832      Keith    Male   2/12/2003         3:02 PM  120672   19.467
855    Phillip     NaN  10/20/2003        11:09 AM   89700    2.277
887      David    Male   12/5/2009         8:48 AM   92242   15.407

    Senior_Management             Team   Bonus
0                True        Marketing  194616
1                True              NaN  123866
2               False          Finance  261180
3                True          Finance  277410
4                True  Client Services  202008
..                ...              ...     ...
712              True      Engineering  247926
749             False            Legal  171578
832             False            Legal  241344
855              True              NaN  179400
887             False            Legal  184484

[201 rows x 9 columns]

#### Drop missing Data
##### Drop the missing data in the First_Name

In [33]:
print(df.dropna(subset='First_Name'))

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[933 rows x 9 columns]

#### Modify Column
##### Modify the Salary Column

In [34]:
df['Salary'] = df['Salary']*2

print(df)

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM  194616    6.945
1       Thomas    Male   3/31/1996         6:53 AM  123866    4.170
2        Maria  Female   4/23/1993        11:17 AM  261180   11.858
3        Jerry    Male    3/4/2005         1:00 PM  277410    9.340
4        Larry    Male   1/24/1998         4:47 PM  202008    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  264966   16.655
996    Phillip    Male   1/31/1984         6:30 AM   84784   19.675
997    Russell    Male   5/20/2013        12:39 PM  193828    1.421
998      Larry    Male   4/20/2013         4:45 PM  121000   11.985
999     Albert    Male   5/15/2012         6:24 PM  259898   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[1000 rows x 9 columns]

#### Rename Colums
##### Rename the First_Name to Name column

In [36]:
print(df.rename(columns={'First_Name': 'Name'}))

        Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0    Douglas    Male    8/6/1993        12:42 PM  194616    6.945
1     Thomas    Male   3/31/1996         6:53 AM  123866    4.170
2      Maria  Female   4/23/1993        11:17 AM  261180   11.858
3      Jerry    Male    3/4/2005         1:00 PM  277410    9.340
4      Larry    Male   1/24/1998         4:47 PM  202008    1.389
..       ...     ...         ...             ...     ...      ...
995    Henry     NaN  11/23/2014         6:09 AM  264966   16.655
996  Phillip    Male   1/31/1984         6:30 AM   84784   19.675
997  Russell    Male   5/20/2013        12:39 PM  193828    1.421
998    Larry    Male   4/20/2013         4:45 PM  121000   11.985
999   Albert    Male   5/15/2012         6:24 PM  259898   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[1000 rows x 9 columns]

#### Change the Data Type
##### Change the Bonus Data Type float to int

In [41]:
df['Bonus'] = df['Bonus'].astype(int)

print(df)

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM  194616    6.945
1       Thomas    Male   3/31/1996         6:53 AM  123866    4.170
2        Maria  Female   4/23/1993        11:17 AM  261180   11.858
3        Jerry    Male    3/4/2005         1:00 PM  277410    9.340
4        Larry    Male   1/24/1998         4:47 PM  202008    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  264966   16.655
996    Phillip    Male   1/31/1984         6:30 AM   84784   19.675
997    Russell    Male   5/20/2013        12:39 PM  193828    1.421
998      Larry    Male   4/20/2013         4:45 PM  121000   11.985
999     Albert    Male   5/15/2012         6:24 PM  259898   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[1000 rows x 9 columns]

#### Fill the Missing Data
#### Fill the missing data with 0 in Salary

In [46]:
df['Salary'].fillna(0, inplace=True)

print(df)

    First_Name  Gender  Start_Date Last_Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM  194616    6.945
1       Thomas    Male   3/31/1996         6:53 AM  123866    4.170
2        Maria  Female   4/23/1993        11:17 AM  261180   11.858
3        Jerry    Male    3/4/2005         1:00 PM  277410    9.340
4        Larry    Male   1/24/1998         4:47 PM  202008    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  264966   16.655
996    Phillip    Male   1/31/1984         6:30 AM   84784   19.675
997    Russell    Male   5/20/2013        12:39 PM  193828    1.421
998      Larry    Male   4/20/2013         4:45 PM  121000   11.985
999     Albert    Male   5/15/2012         6:24 PM  259898   10.169

    Senior_Management                  Team   Bonus
0                True             Marketing  194616
1                True                   NaN  123866
2               False               Finance  261180
3                True               Finance  277410
4                True       Client Services  202008
..                ...                   ...     ...
995             False          Distribution  264966
996             False               Finance   84784
997             False               Product  193828
998             False  Business Development  121000
999              True                 Sales  259898

[1000 rows x 9 columns]

C:\Users\Zaidb\AppData\Local\Temp\ipykernel_6060\2688957846.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(0, inplace=True)

#### Reshape Data: Concatenate
##### Join the two DataFrame Vertically

In [47]:
# Sample DataFrames
df1 = pd.DataFrame({
    'student_id': [1, 2, 3, 4],
    'name': ['Mason', 'Ava', 'Taylor', 'Georgia'],
    'age': [8, 6, 15, 17]
})

df2 = pd.DataFrame({
    'student_id': [5, 6],
    'name': ['Leo', 'Alex'],
    'age': [7, 7]
})

# Concatenating DataFrames
result = pd.concat([df1, df2], ignore_index=True)

# Display the result
print(result)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

#### Reshape Data: Pivot

In [50]:

# Sample DataFrame
data = {
    'city': ['Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville',
             'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
    'month': ['January', 'February', 'March', 'April', 'May',
              'January', 'February', 'March', 'April', 'May'],
    'temperature': [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]
}

weather = pd.DataFrame(data)

# Pivot the DataFrame
pivoted_weather = weather.pivot(index='month', columns='city', values='temperature')

# Resetting the index to match the expected output format
pivoted_weather = pivoted_weather.reset_index()

# Display the result
print(pivoted_weather)

city     month  ElPaso  Jacksonville
0        April       2             5
1     February       6            23
2      January      20            13
3        March      26            38
4          May      43            34

#### Reshape Data : Melt

In [51]:
# Sample DataFrame
data = {
    'product': ['Umbrella', 'SleepingBag'],
    'quarter_1': [417, 800],
    'quarter_2': [224, 936],
    'quarter_3': [379, 93],
    'quarter_4': [611, 875]
}

report = pd.DataFrame(data)

# Reshaping the DataFrame using melt
reshaped_report = pd.melt(report, id_vars=['product'], 
                          value_vars=['quarter_1', 'quarter_2', 'quarter_3', 'quarter_4'],
                          var_name='quarter', value_name='sales')

# Display the result
print(reshaped_report)

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

#### Method Chaining

##### display the First_Name with salary more than 250000 and sort by descending

In [56]:
print(df[df['Salary'] > 250000].sort_values(by='Salary', ascending=False)[['First_Name']])

    First_Name
644  Katherine
429       Rose
828    Cynthia
186        NaN
160      Kathy
..         ...
66       Nancy
305   Margaret
282       Carl
503      Roger
623      Irene

[192 rows x 1 columns]